---
kind: enumMember
id: F:Autodesk.Revit.DB.Lighting.LightShapeStyle.Line
enum: Autodesk.Revit.DB.Lighting.LightShapeStyle
zh: 线、直线
source: html/5ac5e53b-c8d1-538d-40ba-7e8a5e936341.htm
---
# Autodesk.Revit.DB.Lighting.LightShapeStyle.Line

**中文**: 线、直线

Line light shape.